Tekla.Structures.Drawing.ReportTemplateElement
The ReportTemplateElement class represents a template in the Tekla Structures template library.

Tekla.Structures.Drawing.ReportTemplateElement.Template
The template.

Tekla.Structures.Drawing.ReportTemplateElement.#ctor
Creates a new report template element instance with the default template.

Tekla.Structures.Drawing.ReportTemplateElement.#ctor(Tekla.Structures.Drawing.TemplateInfo)
Creates a new report template element instance with the given template.
Template: The template to be used.

Tekla.Structures.Drawing.ReportTemplateElement.Clone
Clones the object.
Returns: A copy of the object.

Tekla.Structures.Drawing.ReportTemplateElement.IsEqual(System.Object)
Compares the current object with an object of the same type.
ObjectToCompare: The object to be used for comparing.
Returns: True if all the fields (except for the database GUID) of the objects match.

Tekla.Structures.Drawing.ReportTemplateElement.GetUnformattedString
Returns the content as a string without formatting.
Returns: The content as a string without formatting.